import React, { Component } from 'react';
import { View, ScrollView } from 'react-native';
import ShowModel from './index';
import { pxToDp } from '../../utils/stylesKits';

class Demo extends Component {
    state = {
        arr: [
            [
                {
                    id: 1,
                    uriFace: 'https://img.mp.itc.cn/upload/20170419/bad415b399644347abc4e1d326425793',
                    uriBack: 'https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fs16.sinaimg.cn%2Fmw690%2F00688vlQzy759KVVTUX6f&refer=http%3A%2F%2Fs16.sinaimg.cn&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=jpeg?sec=1629551057&t=70fcff7dd4c737c7460e23d49b8c8247',
                    title: '立春',
                    recommend: '立春时天地阳气生发，与肝相应，人易暴怒、易感忧郁，而一杯暖暖的茉莉花茶，可安定情绪，舒缓神经。因为茉莉花有理气开郁、辟秽和中的功效，可清肝明目、生津止渴、通便利水、祛风解表。',
                    teaname: '茉莉花茶',
                    textline1: '1、茉莉花性寒、味香淡、消胀气，味辛、甘，性温，有理气止痛、温中和胃、消肿解毒、强化免疫系统的功效，并对痢疾、腹痛、结膜炎及疮毒等具有很好的消炎解毒的作用。',
                    textline2: '2、茉莉花有清肝明目、生津止渴、祛痰治痢、通便利水、祛风解表、疗瘘、坚齿、益气力、降血压、强心、防龋防辐射损伤、抗癌、抗衰老之功效，使人延年益寿、身心健康。',
                    textline3: '3、茉莉花有理气安神、润肤香肌之功效，其香气怡人、它对于便秘也有帮助，使排便顺畅，可改善昏睡及焦虑现象，对慢性胃病、经期失调也有功效。肠胃不适，子宫保健，头晕安神，可安定情绪及舒解郁闷。',
                    textline4: '4、茉莉花有抗菌，平喘，抗癌，舒筋活血，驱风散寒，振脾健胃，强心益肝，降低血压，补肾壮精功效，有慢性支气管炎的人宜多饮用。',
                    textline5: '5、喝花茶不仅可以美容养颜，还有治疗一些疾病的功效，茉莉花与粉红玫瑰花搭配冲泡饮用有瘦身的效果，特别有助于排出体内毒素，外用润燥香肌，美发美容。',
                },
            ],
            [
                {
                    id: 2,
                    uriFace: 'https://img.mp.itc.cn/upload/20170419/1bb7d169047a4decbb3a31c85f0b244a',
                    uriBack: 'https://img1.baidu.com/it/u=1925598151,1047311331&fm=26&fmt=auto&gp=0.jpg',
                    title: '雨水',
                    recommend: '雨水时气温回升，降水增多，乍暖还寒，寒湿之邪最易困着脾脏，健脾行气之茶最是适宜。柑皮，具理气降逆、调中开胃、燥湿化痰之功效。与熟普搭配，不仅有舒肝解郁的功效，而且在熟普中有益菌的作用下，柑普还对胃肠道有温和的刺激作用，显示了芳香健胃和驱风下气的作用。',
                    teaname: '柑普',
                    textline1: '1、降脂减肥的功效；普洱茶经发酵后生成新的脂肪分解酶，而陈皮所含物质能够润滑肠道，二者结合能够起到降脂减肥的效果，是众多肥胖者的福音。',
                    textline2: '2、降压、预防动脉硬化；人们在经年累月中，因为生活习惯、生活压力等原因，身体渐渐出现血压高，动脉硬化的症状，虽然有许多的药物可以治疗，但“是药三分毒”。要是有一种方法既能缓解这两种症状又不会有副作用是不是就万幸了呢？而“柑普茶”是恰恰能够带来万幸的饮品，坚持长期饮用柑普茶能够减轻高血压、动脉硬化等症状。　3、防癌、抗癌；科学家经过大量的实验对比，发现经常喝茶的人比不喝茶的人癌症发病率低。',
                    textline3: '3、茉莉花有理气安神、润肤香肌之功效，其香气怡人、它对于便秘也有帮助，使排便顺畅，可改善昏睡及焦虑现象，对慢性胃病、经期失调也有功效。肠胃不适，子宫保健，头晕安神，可安定情绪及舒解郁闷。',
                    textline4: '4、美容、养颜、抗衰老；柑普茶富含维生素C、维生素E、茶多酚、氨基酸和微量元素等具有抗氧化作用的元素，同时调节身体新陈代谢，促进血液循环，缓解身体衰老加速。',
                    textline5: '5、养胃、护胃；用经过时间陈化后的普洱茶和陈皮做成的柑普茶，茶性温和，且茶中所富含的物质能够对胃进行养护。',
                },
            ],
            [
                {
                    id: 3,
                    uriFace: 'https://img.mp.itc.cn/upload/20170419/85c9703b8b4740aab02fbdd5a81ac513',
                    uriBack: 'https://img1.baidu.com/it/u=531588262,504197565&fm=26&fmt=auto&gp=0.jpg',
                    title: '惊蛰',
                    recommend: '惊蛰时节阳气升发，气温明显升高。因暖生燥，应保持心平气和，忌妄动肝火，需清肝明目、镇定降压之茶。白茶本身有着不俗的药用价值，又因白牡丹叶嫩，富含氨基酸，且茶性清凉，退热降火之功效不可小觑。',
                    teaname: '白牡丹',
                    textline1: '1、美容养颜,常喝白牡丹茶有美容养颜的好处，从而能够有效保养肌肤，延缓衰老。那么白牡丹茶叶是典型的女性茶，坚持饮用，美容功效比较显著，特别受都市女性的青睐。各位爱美的女士们，值得试试。',
                    textline2: '2、抗氧化,常喝白牡丹茶有抗氧化的好处，从而能够有效的给身体起到保健作用。因为白牡丹茶富含黄酮成分，黄酮是天然的抗氧化剂，具有很强的抗氧化作用，能有效中和外线和环境污染所生成的活性自由基，喝一杯白牡丹茶叶的保健功效相当于12杯橙汁。',
                    textline3: '3、抗菌消炎，常喝白牡丹茶有抗菌消炎的好处，从而能够有效避免病菌的侵害。那么白牡丹茶具有效杀菌、消炎、抗病毒之保健功效，其杀菌效果比绿茶还要强。据说上等的白牡丹茶杀菌抗病毒能力更强。',
                    textline4: '4、生津解渴，常喝白牡丹茶有生津止渴的好处，对于夏季来说是极好的降火凉茶。因为白牡丹茶含有大量的氨基酸、茶多酚、维生素等，经常喝些白牡丹茶，不仅能生津解渴，祛暑解毒，还有助于提神醒脑，令人心旷神怡，更是夏日的最佳茶饮。',
                    textline5: '5、润肺清热,常喝白牡丹茶有润肺清热的好处，可见其还具有很好的药用价值。那么白牡丹茶是经常被人们当药使用的。在炎热的夏季，常喝白牡丹茶还能有预防中暑、抗辐射。',
                },
            ],
        ]

    }
    render() {
        return (
            <View>
                <ScrollView
                    horizontal={true} // 横向
                    showsHorizontalScrollIndicator={false}
                    style={{ marginTop: pxToDp(10), backgroundColor: '#D2DFD5' }}
                >
                    {this.state.arr.map((item, index) => (
                        <ShowModel key={index} arr={item} />
                    ))}
                </ScrollView>
            </View>
        );
    }
}

export default Demo;